#+TITLE: Doom Emacs Literate Config Private
#+AUTHOR: linuxing3
# FIXME doom emacs config
*** Setting Org-publish-project-alist

Following the [[https://orgmode.org/worg/org-tutorials/org-jekyll.html][worg guide ]]and [[https://gitlab.com/librephoenix/librephoenix.com.git][Blog with Org Mode]], we need to start by setting the [[file+emacs:org-publish-project-alist][org-publish-project-alist ]]variable so that we are able to publish org files from the org directory to html files in the jekyll directory. This is necessary because Jekyll can only natively handle html and markdown, not org. I like to do this by creating a .dir-locals.el file in the project root and setting it to the appropriate values. This is what mine looks like:

Following the [[https://orgmode.org/worg/org-tutorials/org-jekyll.html][public-with-org]]

#+begin_src emacs-lisp :tangle ~/.config/doom/private.el
(setq org-publish-project-alist
   '(
    ("efwmc-blog.xyz"
          ;; Path to your org files.
          :base-directory "~/sources/efwmc-blog/org/"
          :base-extension "org"

          ;; Path to your Jekyll project.
          :publishing-directory "~/sources/efwmc-blog/jekyll/"
          :recursive t
          :publishing-function org-html-publish-to-html
          :headline-levels 4
          :html-extension "html"
          :body-only t ;; Only export section between <body> </body>
    )

    ("assets-efwmc-blog.xyz"
          :base-directory "~/sources/efwmc-blog/org/"
          :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|php"
          :publishing-directory "~/sources/efwmc-blog/jekyll/"
          :recursive t
          :publishing-function org-publish-attachment
    )

    ("efwmc-blog.com" :components ("efwmc-blog.xyz" "assets-efwmc-blog.xyz"))
))
#+end_src

#+RESULTS:
| efwmc-blog.xyz        | :base-directory | ~/sources/efwmc-blog/org/              | :base-extension | org  | :publishing-directory | ~/sources/efwmc-blog/jekyll/ | :recursive | t    | :publishing-function | org-html-publish-to-html | :headline-levels |    4 | :html-extension | html                  | :body-only               | t          |   |                      |                        |
| assets-efwmc-blog.xyz | :base-directory | ~/sources/efwmc-blog/org/              | :base-extension | css\ | js\                   | png\                         | jpg\       | gif\ | pdf\                 | mp3\                     | ogg\             | swf\ | php             | :publishing-directory | ~/Org/efwmc-blog/jekyll/ | :recursive | t | :publishing-function | org-publish-attachment |
| efwmc-blog.com        | :components     | (efwmc-blog.xyz assets-efwmc-blog.xyz) |                 |      |                       |                              |            |      |                      |                          |                  |      |                 |                       |                          |            |   |                      |                        |

**** In your =config.el= file, require =org-protocol-capture-html= and configure =org-capture-templates=

#+begin_src emacs-lisp :tangle ~/.config/doom/private.el
(add-load-path! (expand-file-name "~/.config/doom/package"))
(after! org
    (require 'org-protocol)
    (require 'org-protocol-capture-html)

    (require 'org-web-tools)
    (setq org-protocol-default-template-key "w")

    (add-to-list 'org-capture-templates
        '("w" "Web Clip" entry (file+olp "~/Org/bookmark.org" "Web")
        (function (lambda ()
                (string-join
                '("* %:description"
                    ":PROPERTIES:"
                    ":CREATED: %U"
                    ":END:"
                    "%:annotation"
                    "%i"
                    ""
                    "%?")
                "\n")))
        :prepend t))
)

#+end_src

#+RESULTS:
| w | Web Clip | entry | (file+olp ~/Org/inbox.org Web) | #'(lambda nil (string-join '(* %(decode-capture-component :description) :PROPERTIES: :CREATED: %U :END: %:annotation %(i)  %?) |
